export const MATRIX_RUB_LB = {
  "a.1": {
    shares: [60, 60, 60, 50, 50, 60, 70],
    portfolios: [
      ["ПИФ 1", "ПИФ 2", "ПИФ 3", "ПИФ 3", "САМИТ N", "САМИТ P", "САМИТ P"],
      ["ПИФ 1", "ПИФ 2", "ПИФ 2", "ПИФ 3", "САМИТ N", "САМИТ N", "САМИТ P"],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 50, 50, 100, 100],
    portfolios: [
      ["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "ОФЗ", "ОФЗ"],
      ["ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "КОРП", "КОРП", "КОРП"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "САМИТ N", "ПИФ 3", "ПИФ 3", "ПИФ 3"]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "САМИТ N", "БПИФ", "БПИФ", "БПИФ"]],
  },
  "b.1": {
    shares: [60, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ПИФ 1", "ПИФ 2", "ПИФ 3", "ПИФ 3", "ВФА", "САМИТ N", "САМИТ P"],
      ["ПИФ 1", "ПИФ 2", "ПИФ 2", "ПИФ 3", "ВФА", "САМИТ P", "САМИТ P"],
    ],
  },
  "b.2": {
    shares: [0, 0, 0, 60, 80, 70, 70],
    portfolios: [
      ["", "", "", "САМИТ N", "САМИТ N", "БПИФ", "ВФА"],
      ["", "", "", "ВФА", "ПИФ 3", "ВФА", "БПИФ"],
      ["", "", "", "ВФА", "БПИФ", "БПИФ", "БПИФ"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 50, 50, 50, 50],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "c.1": {
    shares: [60, 60, 60, 50, 30, 70, 50],
    portfolios: [
      ["ПИФ 1", "ПИФ 2", "ПИФ 3", "ПИФ 3", "ПИФ 3", "САМИТ N", "САМИТ P"],
      ["ПИФ 1", "ПИФ 2", "ПИФ 2", "ПИФ 3", "ПИФ 3", "САМИТ P", "ВФА"],
    ],
  },
  "c.2": {
    shares: [0, 0, 0, 60, 80, 70, 70],
    portfolios: [
      ["", "", "", "САМИТ N", "САМИТ N", "САМИТ N", "БПИФ"],
      ["", "", "", "ВФА", "ВФА", "ВФА", "БПИФ"],
      ["", "", "", "ВФА", "БПИФ", "БПИФ", "БПИФ"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 50, 50, 50, 50],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "d.1": {
    shares: [60, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ЕО", "ЕО", "ДУ 3", "ДУ 3", "АК", "АК", "САМИТ P"],
      ["ПИФ 1", "ДУ 2", "ДУ 2", "ПИФ 3", "АК", "АК", "ВФА"],
    ],
  },
  "d.2": {
    shares: [50, 0, 0, 60, 80, 70, 70],
    portfolios: [
      ["ДУ 2", "ПИФ 1", "ПИФ 2", "САМИТ N", "САМИТ N", "САМИТ N", "АК"],
      ["ВФА", "ВФА", "ПИФ 3", "ВФА", "ВФА", "САМИТ P", "АК"],
      ["ДУ 2", "ПИФ 2", "АК", "АК", "БПИФ", "ВФА", "АК"],
    ],
  },
  "d.3": {
    shares: [99, 99, 99, 99, 99, 99, 99],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["AD", "AD", "AD", "ЛБ", "ЛБ", "ЛБ", "ЛБ"]],
  },
};
