export const MATRIX_CUR_REC = {
  "a.1": {
    shares: [100, 100, 100, 80, 60, 60, 30],
    portfolios: [
      [
        "ЕО 1000",
        "ЕО 1000",
        "Finex 1",
        "Finex 2",
        "Finex 3",
        "Finex 3",
        "Finex 3",
      ],
      [
        "ЕО 1000",
        "ЕО 1000",
        "Finex 2",
        "Finex 3",
        "Finex 3",
        "БПИФ $",
        "БПИФ $",
      ],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 100, 100, 50, 70],
    portfolios: [
      ["USD", "USD", "USD", "USD", "USD", "ВФА $", "ВФА $"],
      ["USD", "USD", "USD", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "ЕО 1000", "ЕО 1000"]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [50, 40, 40, 30, 20, 15, 10],
    portfolios: [
      ["ЕО 1000", "Finex 2", "ПИФ $3", "ПИФ $3", "ПИФ $3", "ПИФ $3", "ПИФ $3"],
      [
        "ЕО 1000",
        "ПИФ $2",
        "Finex 3",
        "Finex 3",
        "Finex 3",
        "Finex 3",
        "Finex 3",
      ],
    ],
  },
  "b.2": {
    shares: [60, 50, 50, 50, 60, 70, 80],
    portfolios: [
      ["ПИФ $1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ПИФ $1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ПИФ $1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["USD", "ПИФ $1", "ЕО 1000", "USD", "USD", "USD", "USD"]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "c.1": {
    shares: [50, 40, 40, 30, 20, 15, 10],
    portfolios: [
      ["ВФА $", "ЕТФ 2", "ПИФ $2", "ЕТФ 2", "ЕТФ 2", "ЕТФ 2", "ЕТФ 2"],
      ["ВФА $", "ЕТФ 1", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3"],
    ],
  },
  "c.2": {
    shares: [50, 50, 50, 50, 60, 70, 80],
    portfolios: [
      ["ЕТФ 1", "ДУ $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ЕТФ 1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ЕТФ 1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ЕТФ 1", "КОРП", "ЕО 1000", "USD", "USD", "USD", "USD"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "d.1": {
    shares: [70, 60, 40, 30, 20, 15, 10],
    portfolios: [
      ["ЕТФ 1", "ЕО", "ДУ $1", "ДУ $3", "ДУ $3", "ДУ $3", "ДУ $3"],
      ["ПИФ $1", "ДУ $1", "ДУ $1", "ДУ $1", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3"],
    ],
  },
  "d.2": {
    shares: [50, 99, 50, 60, 60, 99, 99],
    portfolios: [
      ["ВФА $", "ВФА $", "нота $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ВФА $", "ВФА $", "нота $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
    ],
  },
  "d.3": {
    shares: [99, 100, 99, 99, 99, 100, 100],
    portfolios: [["ЕО 1000", "AD$", "ПИФ $2", "ПИФ $3", "ПИФ $3", "ЛБ$", "ЛБ"]],
  },
  "d.4": {
    shares: [100, 0, 100, 100, 100, 0, 0],
    portfolios: [["AD$", "", "AD$", "ЛБ$", "ЛБ$", "", ""]],
  },
};
