export const MATRIX_RUB_LB = {
  "a.1": {
    shares: [60, 60, 60, 50, 50, 60, 70],
    portfolios: [
      ["ПИФ 1Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р", "САМИТ N", "САМИТ P", "САМИТ P"],
      ["ПИФ 1Р", "ПИФ 2Д", "ПИФ 2Р", "ПИФ 3Д", "САМИТ N", "САМИТ N", "САМИТ P"],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 50, 50, 50, 50],
    portfolios: [
      ["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "ОФЗ", "ОФЗ"],
      ["ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "КОРП", "КОРП", "КОРП"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 50, 50, 50],
    portfolios: [["", "", "", "САМИТ N", "ПИФ 3Р", "ПИФ 3Р", "ПИФ 3Р"]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 100, 100, 100],
    portfolios: [["", "", "", "", "БПИФ", "БПИФ", "БПИФ"]],
  },
  "b.1": {
    shares: [60, 60, 60, 50, 60, 40, 50],
    portfolios: [
      ["ПИФ 1Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р", "ВФА", "САМИТ N", "САМИТ P"],
      ["ПИФ 1Р", "ПИФ 2Д", "ПИФ 2Р", "ПИФ 3Д", "ВФА", "САМИТ P", "САМИТ P"],
    ],
  },
  "b.2": {
    shares: [0, 0, 0, 60, 80, 70, 70],
    portfolios: [
      ["", "", "", "САМИТ N", "САМИТ N", "БПИФ", "ВФА"],
      ["", "", "", "ВФА", "ПИФ 3Р", "ВФА", "БПИФ"],
      ["", "", "", "ВФА", "ПИФ 4Д", "ПИФ 3Р", "ПИФ 3Р"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 50, 50, 50, 50],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "b.4": {
    shares: [0, 0, 0, 100, 100, 100, 100],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "c.1": {
    shares: [60, 60, 60, 50, 30, 70, 50],
    portfolios: [
      ["ПИФ 1Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р", "ПИФ 3Р", "САМИТ N", "САМИТ P"],
      ["ПИФ 1Р", "ПИФ 2Д", "ПИФ 2Р", "ПИФ 3Д", "ПИФ 3Д", "САМИТ P", "ВФА"],
    ],
  },
  "c.2": {
    shares: [0, 0, 0, 60, 80, 70, 70],
    portfolios: [
      ["", "", "", "САМИТ N", "САМИТ N", "САМИТ N", "БПИФ"],
      ["", "", "", "ВФА", "ВФА", "ВФА", "ПИФ 3Р"],
      ["", "", "", "ВФА", "ПИФ 2Р", "БПИФ", "ПИФ 3Д"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 50, 50, 50, 50],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "c.4": {
    shares: [0, 0, 0, 100, 100, 100, 100],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "d.1": {
    shares: [60, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ЕО", "ЕО", "ПИФ 3Р", "ПИФ 3Р", "АК", "АК", "САМИТ P"],
      ["ПИФ 1Р", "ПИФ 2Р", "ПИФ 2Р", "ПИФ 3Д", "АК", "АК", "ВФА"],
    ],
  },
  "d.2": {
    shares: [50, 50, 50, 60, 80, 70, 70],
    portfolios: [
      ["ПИФ 2Р", "ПИФ 1Р", "ПИФ 2Д", "САМИТ N", "САМИТ N", "САМИТ N", "АК"],
      ["ВФА", "ВФА", "ПИФ 3Д", "ВФА", "ВФА", "САМИТ P", "АК"],
      ["ПИФ 2Д", "ПИФ 2Д", "АК", "АК", "ПИФ 2Р", "ВФА", "АК"],
    ],
  },
  "d.3": {
    shares: [99, 99, 100, 100, 100, 100, 100],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["AD", "AD", "AD", "ЛБ", "ЛБ", "ЛБ", "ЛБ"]],
  },
};
