export const MATRIX_RUB_NONE = {
  "a.1": {
    shares: [20, 30, 40, 50, 60, 70, 80],
    portfolios: [
      [
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ P",
      ],
      [
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ P",
        "САМИТ P",
        "САМИТ P",
      ],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "ОФЗ", "ОФЗ"],
      ["ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "КОРП", "КОРП", "КОРП"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [20, 30, 40, 50, 60, 70, 80],
    portfolios: [
      [
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ P",
      ],
      [
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ P",
        "САМИТ P",
        "САМИТ P",
      ],
    ],
  },
  "b.2": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [
      ["", "", "", "", "", "", ""],
      ["", "", "", "", "", "", ""],
      ["", "", "", "", "", "", ""],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "c.1": {
    shares: [20, 30, 60, 50, 60, 70, 50],
    portfolios: [
      [
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ P",
      ],
      [
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ P",
        "САМИТ P",
        "САМИТ P",
      ],
    ],
  },
  "c.2": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [
      ["", "", "", "", "", "", ""],
      ["", "", "", "", "", "", ""],
      ["", "", "", "", "", "", ""],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "d.1": {
    shares: [20, 30, 40, 50, 60, 70, 80],
    portfolios: [
      ["САМИТ N", "САМИТ N", "САМИТ N", "ЕО", "САМИТ N", "САМИТ N", "САМИТ P"],
      [
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ N",
        "САМИТ P",
        "САМИТ P",
        "САМИТ P",
      ],
    ],
  },
  "d.2": {
    shares: [50, 0, 0, 0, 50, 50, 50],
    portfolios: [
      ["ЕО", "ЕО", "ЕО", "ЕО", "ЕО", "ЕО", "ЕО"],
      ["ЕО", "КОРП", "КОРП", "ЕО", "ЕО", "ЕО", "ЕО"],
      ["ЕО", "ОФЗ", "ОФЗ", "ОФЗ", "ЕО", "ЕО", "ЕО"],
    ],
  },
  "d.3": {
    shares: [99, 99, 99, 99, 99, 99, 99],
    portfolios: [["ЕО", "ЕО", "ЕО", "КОРП", "ОФЗ", "ОФЗ", "КОРП"]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
};
