export const MATRIX_CUR_READY = {
  "a.1": {
    shares: [100, 100, 80, 80, 50, 50, 70],
    portfolios: [
      ["ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $2", "ПИФ $3", "ПИФ $3"],
      ["ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $2", "ПИФ $3", "ПИФ $3"],
    ],
  },
  "a.2": {
    shares: [0, 100, 80, 100, 100, 100, 100],
    portfolios: [
      ["", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
      ["", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "ПИФ $2", "", "", "", ""]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [100, 80, 40, 50, 50, 50, 80],
    portfolios: [
      ["ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $2", "ПИФ $3", "ПИФ $3"],
      ["ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $2", "ПИФ $2", "ПИФ $3"],
    ],
  },
  "b.2": {
    shares: [0, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
      ["", "ПИФ $2", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
      ["", "ПИФ $2", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "c.1": {
    shares: [100, 70, 40, 50, 50, 60, 80],
    portfolios: [
      ["ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $2", "ПИФ $3", "ПИФ $3"],
      ["ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $1", "ПИФ $2", "ПИФ $3", "ПИФ $3"],
    ],
  },
  "c.2": {
    shares: [0, 100, 100, 60, 50, 50, 50],
    portfolios: [
      ["", "ПИФ $2", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
      ["", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
      ["", "ПИФ $2", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $", "БПИФ $"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 60, 100, 100, 90],
    portfolios: [["", "", "", "ПИФ $3", "ПИФ $1", "ПИФ $2", "ПИФ $2"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "d.1": {
    shares: [70, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ДУ $1", "ПИФ $2", "БПИФ $", "БПИФ $", "ПИФ $3", "ПИФ $3", "БПИФ $"],
      ["ДУ $1", "ПИФ $2", "ПИФ $2", "ПИФ $2", "ПИФ $3", "ПИФ $3", "БПИФ $"],
    ],
  },
  "d.2": {
    shares: [100, 70, 80, 60, 70, 70, 90],
    portfolios: [
      ["ПИФ $1", "ДУ $1", "ДУ $1", "ДУ $1", "ДУ $2", "ДУ $3", "ДУ $3"],
      ["ПИФ $1", "ДУ $1", "ДУ $1", "ДУ $1", "ДУ $2", "ДУ $3", "ДУ $3"],
      ["ПИФ $1", "ДУ $1", "ДУ $1", "ДУ $1", "ДУ $2", "ДУ $3", "ДУ $3"],
    ],
  },
  "d.3": {
    shares: [100, 50, 50, 50, 50, 100, 100],
    portfolios: [
      ["", "ПИФ $1", "ПИФ $1", "ДУ $3", "ПИФ $2", "ПИФ $2", "ПИФ $3"],
    ],
  },
  "d.4": {
    shares: [0, 100, 100, 100, 100, 0, 0],
    portfolios: [["", "ДУ $2", "ДУ $3", "ДУ $3", "БПИФ $", "", ""]],
  },
};
