export const MATRIX_RUB_READY = {
  "a.1": {
    shares: [80, 60, 60, 50, 60, 60, 70],
    portfolios: [
      ["ПИФ 1Р", "ПИФ 1Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р", "БПИФ", "ПИФ 3Р"],
      ["ПИФ 1Р", "ПИФ 1Д", "ПИФ 2Д", "ПИФ 2Р", "ПИФ 3Д", "ПИФ 3Р", "ПИФ 3Д"],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 100, 50, 100, 70],
    portfolios: [
      ["ПИФ 1Д", "ПИФ 2Р", "ПИФ 1Р", "ПИФ 1Р", "БПИФ", "ПИФ 3Д", "БПИФ"],
      ["", "ПИФ 2Д", "ПИФ 1Д", "ПИФ 2Д", "ПИФ 4Д", "ПИФ 4Д", "ПИФ 4Д"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "ПИФ 1Р", "", "ПИФ 1Р"]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [80, 60, 60, 50, 60, 70, 40],
    portfolios: [
      ["ПИФ 1Р", "ПИФ 1Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р", "БПИФ", "ПИФ 3Р"],
      ["ПИФ 1Р", "ПИФ 1Д", "ПИФ 2Р", "ПИФ 2Р", "ПИФ 3Д", "ПИФ 3Р", "ПИФ 3Д"],
    ],
  },
  "b.2": {
    shares: [100, 100, 100, 100, 70, 70, 70],
    portfolios: [
      ["ПИФ 1Д", "ПИФ 2Р", "ПИФ 1Р", "ПИФ 1Р", "БПИФ", "ПИФ 3Д", "БПИФ"],
      ["ПИФ 1Д", "ПИФ 2Д", "ПИФ 2Д", "ПИФ 2Р", "ПИФ 4Д", "ПИФ 4Д", "ПИФ 4Д"],
      ["ПИФ 1Д", "ПИФ 2Р", "ПИФ 2Д", "ПИФ 2Д", "БПИФ", "ПИФ 3Д", "БПИФ"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "ПИФ 1Р", "ПИФ 1Р", "ПИФ 2Р"]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "c.1": {
    shares: [80, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ПИФ 1Р", "ПИФ 1Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р", "ПИФ 3Р", "ПИФ 3Р"],
      ["ПИФ 1Р", "ПИФ 1Д", "ПИФ 2Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р", "ПИФ 3Р"],
    ],
  },
  "c.2": {
    shares: [100, 100, 100, 100, 70, 70, 70],
    portfolios: [
      ["ПИФ 2Р", "ПИФ 2Р", "ПИФ 1Р", "ПИФ 2Д", "БПИФ", "БПИФ", "БПИФ"],
      ["ПИФ 2Д", "ПИФ 2Д", "ПИФ 2Д", "ПИФ 3Д", "ПИФ 4Д", "ПИФ 4Д", "ПИФ 4Д"],
      ["ПИФ 2Р", "ПИФ 2Р", "ПИФ 2Д", "ПИФ 4Д", "БПИФ", "БПИФ", "БПИФ"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "ПИФ 1Р", "ПИФ 1Р", "ПИФ 2Р"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "d.1": {
    shares: [50, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ДУ 2Р", "ДУ 2Р", "ДУ 3Р", "ДУ 3Р", "ДУ 3Р", "ДУ 3Р", "ДУ 3Р"],
      ["ПИФ 1Р", "ДУ 2Р", "ДУ 2Р", "АК", "АК", "АК", "АК"],
    ],
  },
  "d.2": {
    shares: [80, 80, 100, 100, 80, 70, 70],
    portfolios: [
      ["АК", "ПИФ 1Р", "ПИФ 2Р", "ПИФ 2Р", "БПИФ", "БПИФ", "БПИФ"],
      ["АК", "ПИФ 1Д", "ПИФ 2Д", "ПИФ 3Р", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Р"],
      ["АК", "ПИФ 2Р", "ПИФ 3Р", "ПИФ 3Д", "ДУ 2Р", "ДУ 2Р", "АК"],
    ],
  },
  "d.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ПИФ 2Р", "ПИФ 2Д", "", "", "ПИФ 1Р", "ПИФ 1Р", "ПИФ 2Р"]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
};
