export const MATRIX_CUR_FULL = {
  "a.1": {
    shares: [100, 100, 100, 80, 60, 50, 30],
    portfolios: [
      [
        "ЕО 1000",
        "ЕО 1000",
        "ЕО 1000",
        "Finex 1",
        "Finex 1",
        "Finex 2",
        "Finex 2",
      ],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 50, 100, 50, 50],
    portfolios: [["USD", "USD", "USD", "USD", "USD", "СПБ", "СПБ"]],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "ЕО 1000", "ЕО 1000"]],
  },
  "b.1": {
    shares: [100, 100, 100, 80, 60, 50, 30],
    portfolios: [
      [
        "ЕО 1000",
        "ЕО 1000",
        "ЕО 1000",
        "Finex 1",
        "Finex 1",
        "Finex 2",
        "Finex 2",
      ],
    ],
  },
  "b.2": {
    shares: [100, 100, 50, 100, 100, 100, 80],
    portfolios: [["USD", "СПБ", "СПБ", "ЕО 1000", "ЕО 1000", "СПБ", "СПБ"]],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["0", "0", "0", "СПБ", "СПБ", "ЕО 1000", "ЕО 1000"]],
  },
  "c.1": {
    shares: [50, 40, 40, 50, 40, 30, 20],
    portfolios: [
      [
        "ЕО 1000",
        "ЕО 1000",
        "ЕО 1000",
        "Finex 1",
        "Finex 2",
        "Finex 2",
        "Finex 2",
      ],
      ["ЕО 1000", "ЕО 1000", "Finex 1", "нота $", "нота $", "нота $", "нота $"],
    ],
  },
  "c.2": {
    shares: [60, 40, 50, 80, 80, 80, 80],
    portfolios: [
      ["ЕО 1000", "Finex 1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ПИФ $", "ПИФ $", "нота $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["USD", "USD", "ЕО 1000", "ЕО 1000", "ЕО 1000", "ЕО 1000", "ЕО 1000"],
    ],
  },
  "d.1": {
    shares: [50, 40, 40, 50, 40, 30, 20],
    portfolios: [
      ["ЕО 1000", "ЕО 1000", "нота $", "нота $", "нота $", "нота $", "нота $"],
      ["ПИФ $", "ПИФ $", "Finex 1", "Finex 1", "Finex 2", "Finex 2", "Finex 2"],
    ],
  },
  "d.2": {
    shares: [50, 40, 50, 30, 40, 50, 70],
    portfolios: [
      ["ЕО 1000", "Finex 1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
    ],
  },
  "d.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["USD", "USD", "ЕО 1000", "ЕО 1000", "ЕО 1000", "ЕО 1000", "ЕО 1000"],
    ],
  },
  "e.1": {
    shares: [50, 60, 70, 60, 50, 60, 40],
    portfolios: [
      ["ВФА $", "ВФА $", "ВФА $", "ЕТФ 3", "ВФА $", "ВФА $", "ВФА $"],
      ["ЕО", "ЕО", "ЕО", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
    ],
  },
  "e.2": {
    shares: [50, 50, 40, 30, 40, 30, 80],
    portfolios: [
      ["ЕО 1000", "ЕТФ 1", "ЕТФ 2", "ВФА $", "ЕТФ 3", "ЕТФ 3", "нота $"],
      ["ДУ $", "ДУ $", "Finex 1", "нота $", "нота $", "нота $", "нота $"],
    ],
  },
  "e.3": {
    shares: [100, 100, 100, 100, 10, 10, 100],
    portfolios: [
      [
        "ЕТФ 1",
        "ЕО 1000",
        "ЕО 1000",
        "ЕО 1000",
        "ЕО 1000",
        "ЕО 1000",
        "ЕО 1000",
      ],
    ],
  },
  "f.1": {
    shares: [70, 70, 70, 70, 70, 70, 100],
    portfolios: [["ЕО", "ЕО", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"]],
  },
  "f.2": {
    shares: [70, 70, 70, 70, 50, 70, 50],
    portfolios: [["ДУ $", "ДУ $", "ЕО", "ЕО", "ЕО", "ЕО", "ЕО"]],
  },
  "f.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ЕО 1000", "ЕО 1000", "ЕО 1000", "нота $", "нота $", "нота $", "нота $"],
    ],
  },
};
