export const MATRIX_RUB_FULL = {
  "a.1": {
    shares: [90, 80, 60, 50, 70, 20, 10],
    portfolios: [
      ["ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "ПИФ 3", "ПИФ 3", "Корп"],
      ["ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "ПИФ 3", "ПИФ 3", "Корп"],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 50, 30, 20, 10],
    portfolios: [
      ["ПИФ 1", "Корп", "Корп", "Корп", "Корп", "Корп", "ОФЗ"],
      ["ПИФ 1", "ПИФ 2", "ПИФ 3", "ПИФ 3", "ОФЗ", "ОФЗ", "ОФЗ"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["", "", "", "самИТ", "самИТ", "самИТ", "самИТ"],
      ["", "", "", "самИТ", "самИТ", "самИТ", "самИТ"],
    ],
  },
  "b.1": {
    shares: [90, 50, 30, 100, 100, 100, 10],
    portfolios: [
      ["ОФЗ", "ОФЗ", "ОФЗ", "АК", "АК", "АК", "Корп"],
      ["ОФЗ", "ОФЗ", "ОФЗ", "ПИФ 3", "АК", "АК", "Корп"],
    ],
  },
  "b.2": {
    shares: [100, 50, 50, 30, 50, 70, 90],
    portfolios: [
      ["ПИФ 1", "Корп", "Корп", "самИТ", "ПИФ 3", "самИТ", "самИТ"],
      ["ПИФ 1", "ПИФ 1", "ПИФ 2", "самИТ", "ОФЗ", "самИТ", "АК"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["", "ПИФ 2", "ПИФ 3", "ОФЗ", "самИТ", "Корп", "ОФЗ"],
      ["", "ПИФ 2", "ПИФ 3", "ОФЗ", "самИТ", "ОФЗ", "ОФЗ"],
    ],
  },
  "c.1": {
    shares: [60, 100, 70, 80, 70, 60, 50],
    portfolios: [
      ["СПЗК 100", "СПЗК 98", "СПЗК 95", "МП", "АК", "АК", "АК"],
      ["СПЗК 100", "МП", "МП", "АК", "АК", "АК", "АК"],
    ],
  },
  "c.2": {
    shares: [60, 50, 50, 30, 80, 90, 95],
    portfolios: [
      ["ОФЗ", "Корп", "ПИФ 2", "ПИФ 2", "ВФА", "ВФА", "ВФА"],
      ["ОФЗ", "ПИФ 2", "ПИФ 3", "ПИФ 3", "самИТ", "самИТ", "самИТ"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ПИФ 1", "СПЗК 100", "Корп", "Корп", "ОФЗ", "ОФЗ", "Корп"],
      ["ПИФ 1", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "Корп", "ОФЗ"],
    ],
  },
  "d.1": {
    shares: [50, 70, 70, 50, 50, 60, 75],
    portfolios: [
      ["СПЗК 100", "МП", "МП", "МП", "ВФА", "ВФА", "ВФА"],
      ["СПЗК 100", "СПЗК 98", "СПЗК 95", "ВФА", "ВФА", "ВФА", "ВФА"],
    ],
  },
  "d.2": {
    shares: [50, 50, 50, 50, 80, 80, 100],
    portfolios: [
      ["ОФЗ", "ОФЗ", "ПИФ 2", "АК", "АК", "АК", "АК"],
      ["ОФЗ", "ОФЗ", "ПИФ 3", "ПИФ 3", "АК", "АК", "АК"],
    ],
  },
  "d.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ПИФ 1", "ПИФ 1", "Корп", "Корп", "ОФЗ", "ОФЗ", "Корп"],
      ["ПИФ 1", "ПИФ 2", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"],
    ],
  },
  "e.1": {
    shares: [85, 85, 85, 85, 85, 70, 70],
    portfolios: [
      ["ЕО", "ЕО", "ЕО", "ЕО", "ВФА", "ВФА", "ВФА"],
      ["ЕО", "ЕО", "ЕО", "ЕО", "ВФА", "ВФА", "ВФА"],
    ],
  },
  "e.2": {
    shares: [50, 70, 70, 80, 80, 50, 80],
    portfolios: [
      ["СПЗК 100", "МП", "МП", "ВФА", "АК", "АК", "АК"],
      ["СПЗК 100", "СПЗК 98", "СПЗК 95", "АК", "АК", "АК", "АК"],
      ["ПИФ 1", "ПИФ 2", "ПИФ 3", "АК", "АК", "АК", "АК"],
    ],
  },
  "e.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ОФЗ", "Корп", "Корп", "ПИФ 3", "Корп", "Корп", "Корп"],
      ["ОФЗ", "ОФЗ", "Корп", "ОФЗ", "ОФЗ", "Корп", "Корп"],
    ],
  },
  "f.1": {
    shares: [50, 50, 50, 40, 50, 40, 60],
    portfolios: [
      ["ЕО", "ЕО", "ЕО", "ЕО", "ВФА", "ВФА", "ВФА"],
      ["ЕО", "ПИФ 2", "ПИФ 3", "ЕО", "ВФА", "ВФА", "ВФА"],
    ],
  },
  "f.2": {
    shares: [30, 30, 30, 50, 50, 50, 50],
    portfolios: [["ЕО", "МП", "МП", "ЕО", "АК", "ЕО", "ЕО"]],
  },
  "f.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ПИФ 1", "ОФЗ", "Корп", "ОФЗ", "ЕО", "ЕО", "ЕО"]],
  },
};
