export const MATRIX_CUR_FULL = {
  "a.1": {
    shares: [100, 100, 100, 80, 60, 60, 30],
    portfolios: [
      [
        "ЕО 1000",
        "ЕО 1000",
        "Finex 1",
        "Finex 2",
        "Finex 3",
        "Finex 2",
        "Finex 2",
      ],
      [
        "ЕО 1000",
        "ЕО 1000",
        "Finex 2",
        "Finex 3",
        "Finex 3",
        "Finex 2",
        "Finex 2",
      ],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 100, 100, 50, 70],
    portfolios: [
      ["USD", "USD", "USD", "USD", "USD", "СПБ N", "СПБ N"],
      ["USD", "USD", "USD", "СПБ N", "СПБ N", "СПБ P", "СПБ P"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "ЕО 1000", "ЕО 1000"]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [50, 40, 40, 30, 20, 15, 10],
    portfolios: [
      ["ЕО 1000", "Finex 2", "ПИФ $3", "ПИФ $3", "ПИФ $3", "ПИФ $3", "ПИФ $3"],
      [
        "ЕО 1000",
        "ПИФ $2",
        "Finex 3",
        "Finex 3",
        "Finex 3",
        "Finex 3",
        "Finex 3",
      ],
    ],
  },
  "b.2": {
    shares: [60, 50, 50, 50, 60, 70, 80],
    portfolios: [
      ["ПИФ $1", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "СПБ P"],
      ["ПИФ $1", "ВФА $", "ВФА $", "СПБ N", "СПБ N", "СПБ P", "СПБ P"],
      ["ПИФ $1", "ВФА $", "ВФА $", "СПБ N", "СПБ N", "СПБ N", "ВФА $"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["USD", "ПИФ $1", "ЕО 1000", "USD", "USD", "USD", "USD"]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "c.1": {
    shares: [50, 40, 40, 30, 20, 15, 10],
    portfolios: [
      ["ВФА $", "ЕТФ 2", "ПИФ $2", "ЕТФ 2", "ЕТФ 2", "ЕТФ 2", "ЕТФ 2"],
      ["ДУ $", "ЕТФ 1", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3"],
    ],
  },
  "c.2": {
    shares: [50, 50, 50, 50, 60, 70, 80],
    portfolios: [
      ["ЕТФ 1", "ДУ $", "ВФА $", "ВФА $", "ВФА $", "ВФА $", "ВФА $"],
      ["ЕТФ 1", "ВФА $", "ВФА $", "ИТП N", "ИТП N", "ИТП N", "ИТП P"],
      ["ЕТФ 1", "ВФА $", "ВФА $", "ИТП N", "ИТП N", "ИТП P", "ИТП P"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ЕТФ 1", "КОРП", "ЕО 1000", "USD", "USD", "USD", "USD"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "d.1": {
    shares: [70, 60, 50, 50, 40, 30, 20],
    portfolios: [
      ["ЕО", "ЕО", "ДУ $1", "ДУ $3", "ДУ $3", "ДУ $3", "ДУ $3"],
      ["ПИФ $1", "ДУ $1", "ДУ $1", "ДУ $1", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3"],
    ],
  },
  "d.2": {
    shares: [50, 99, 50, 60, 60, 99, 99],
    portfolios: [
      ["ДУ $1", "ПИФ $1", "нота $", "нота $", "нота $", "ВФА $", "ВФА $"],
      ["ДУ $1", "ПИФ $2", "нота $", "ВФА $", "ВФА $", "ИТП P", "ИТП P"],
      ["ДУ $1", "ПИФ $2", "ВФА $", "ЕТФ 3", "ИТП N", "нота $", "нота $"],
    ],
  },
  "d.3": {
    shares: [99, 100, 99, 99, 99, 100, 100],
    portfolios: [["ЕО 1000", "AD", "ПИФ $2", "ПИФ $3", "ПИФ $3", "ЛБ", "ЛБ"]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
};
