export const MATRIX_RUB_READY = {
  "a.1": {
    shares: [80, 60, 60, 50, 60, 60, 70],
    portfolios: [
      ["ПИФ 1", "ПИФ 1", "ПИФ 2", "ПИФ 3", "ПИФ 3", "БПИФ", "ПИФ 3"],
      ["ПИФ 1", "ПИФ 1", "ПИФ 2", "ПИФ 2", "ПИФ 3", "БПИФ", "ПИФ 3"],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 100, 50, 100, 70],
    portfolios: [
      ["ПИФ 1", "ПИФ 2", "ПИФ 1", "ПИФ 1", "БПИФ", "ПИФ 3", "БПИФ"],
      ["", "ПИФ 2", "ПИФ 1", "ПИФ 2", "БПИФ", "ПИФ 3", "БПИФ"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "ПИФ 1", "", "ПИФ 1"]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [80, 60, 60, 50, 60, 70, 40],
    portfolios: [
      ["ПИФ 1", "ПИФ 1", "ПИФ 2", "ПИФ 3", "ПИФ 3", "БПИФ", "ПИФ 3"],
      ["ПИФ 1", "ПИФ 1", "ПИФ 2", "ПИФ 2", "ПИФ 3", "БПИФ", "ПИФ 3"],
    ],
  },
  "b.2": {
    shares: [100, 100, 100, 100, 70, 70, 70],
    portfolios: [
      ["ПИФ 1", "ПИФ 2", "ПИФ 1", "ПИФ 1", "БПИФ", "ПИФ 3", "БПИФ"],
      ["ПИФ 1", "ПИФ 2", "ПИФ 2", "ПИФ 2", "БПИФ", "ПИФ 3", "БПИФ"],
      ["ПИФ 1", "ПИФ 2", "ПИФ 2", "ПИФ 2", "БПИФ", "ПИФ 3", "БПИФ"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "ПИФ 1", "ПИФ 1", "ПИФ 2"]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "c.1": {
    shares: [80, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ПИФ 1", "ПИФ 1", "ПИФ 2", "ДУ 3", "ПИФ 3", "ДУ 3", "ДУ 3"],
      ["ПИФ 1", "ПИФ 1", "ДУ 2", "ПИФ 2", "ДУ 3", "ПИФ 3", "ПИФ 3"],
    ],
  },
  "c.2": {
    shares: [100, 100, 100, 100, 70, 70, 70],
    portfolios: [
      ["ПИФ 2", "ПИФ 2", "ПИФ 1", "ПИФ 3", "БПИФ", "БПИФ", "БПИФ"],
      ["ДУ 2", "ПИФ 2", "ПИФ 2", "ПИФ 3", "БПИФ", "БПИФ", "БПИФ"],
      ["ДУ 2", "ПИФ 2", "ПИФ 2", "ПИФ 3", "БПИФ", "БПИФ", "БПИФ"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "ПИФ 1", "ПИФ 1", "ПИФ 2"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "d.1": {
    shares: [50, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ДУ 2", "ДУ 2", "ДУ 3", "ДУ 3", "ДУ 3", "ДУ 3", "ДУ 3"],
      ["ПИФ 1", "ДУ 2", "ДУ 2", "АК", "АК", "АК", "АК"],
    ],
  },
  "d.2": {
    shares: [80, 80, 100, 100, 80, 70, 70],
    portfolios: [
      ["АК", "ПИФ 1", "ПИФ 2", "ПИФ 2", "БПИФ", "БПИФ", "БПИФ"],
      ["АК", "ПИФ 1", "ПИФ 2", "ПИФ 3", "ПИФ 2", "ПИФ 3", "ПИФ 3"],
      ["АК", "ПИФ 2", "ПИФ 3", "ПИФ 3", "ДУ 2", "ДУ 2", "АК"],
    ],
  },
  "d.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ПИФ 2", "ПИФ 2", "", "", "ПИФ 1", "ПИФ 1", "ПИФ 2"]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
};
