export const MATRIX_CUR_NONE = {
  "a.1": {
    shares: [20, 30, 40, 50, 60, 70, 80],
    portfolios: [
      ["СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ P"],
      ["СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ P", "СПБ P"],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      [
        "Finex 1",
        "Finex 2",
        "Finex 2",
        "Finex 3",
        "Finex 3",
        "Finex 3",
        "Finex 3",
      ],
      [
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
      ],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [20, 30, 40, 50, 60, 70, 80],
    portfolios: [
      ["СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ P"],
      ["СПБ N", "СПБ N", "СПБ N", "СПБ N", "СПБ P", "СПБ P", "СПБ P"],
    ],
  },
  "b.2": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ЕТФ 1", "ЕТФ 2", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3"],
      [
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
        "eo 1000",
      ],
      ["", "", "", "", "", "", ""],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "c.1": {
    shares: [20, 30, 60, 50, 60, 70, 50],
    portfolios: [
      ["ИТП N", "ИТП N", "ИТП N", "ИТП N", "ИТП N", "ИТП N", "ИТП P"],
      ["ИТП N", "ИТП N", "ИТП N", "ИТП N", "ИТП P", "ИТП P", "ИТП P"],
    ],
  },
  "c.2": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ЕТФ 1", "ЕТФ 2", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3"],
      ["eo 1000", "eo 1000", "eo 1000", "eo 1000", "ЕТФ 2", "ЕТФ 2", "ЕТФ 2"],
      ["", "", "", "", "", "", ""],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "d.1": {
    shares: [90, 80, 70, 40, 50, 60, 80],
    portfolios: [
      ["EO", "EO", "EO", "ИТП N", "ИТП N", "ИТП N", "ИТП P"],
      ["ИТП N", "ИТП N", "ИТП N", "ИТП P", "ИТП P", "ИТП P", "ИТП P"],
    ],
  },
  "d.2": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ЕТФ 1", "ЕТФ 2", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3", "ЕТФ 3"],
      ["eo 1000", "eo 1000", "eo 1000", "eo 1000", "ЕТФ 2", "ЕТФ 2", "ЕТФ 2"],
      ["", "", "", "", "", "", ""],
    ],
  },
  "d.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
};
