export const MATRIX_RUB_REC = {
  "a.1": {
    shares: [50, 40, 30, 20, 40, 60, 70],
    portfolios: [
      ["ВФА", "ВФА", "ВФА", "ВФА", "САМИТ N", "САМИТ N", "САМИТ P"],
      ["ВФА", "ВФА", "ВФА", "ВФА", "БПИФ", "ВФА", "ВФА"],
    ],
  },
  "a.2": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [
      ["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "ОФЗ", "ОФЗ"],
      ["ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ", "КОРП", "КОРП", "КОРП"],
    ],
  },
  "a.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "a.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "", "", "", ""]],
  },
  "b.1": {
    shares: [50, 40, 30, 20, 30, 40, 50],
    portfolios: [
      ["ВФА", "ВФА", "ВФА", "ПИФ 3", "ПИФ 3", "САМИТ N", "САМИТ N"],
      ["ВФА", "ВФА", "ВФА", "ПИФ 3", "САМИТ N", "САМИТ N", "САМИТ N"],
    ],
  },
  "b.2": {
    shares: [0, 0, 0, 60, 70, 70, 70],
    portfolios: [
      ["", "", "", "ВФА", "САМИТ N", "ВФА", "ВФА"],
      ["", "", "", "ВФА", "ВФА", "ВФА", "ВФА"],
      ["", "", "", "ВФА", "ВФА", "БПИФ", "БПИФ"],
    ],
  },
  "b.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "b.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "c.1": {
    shares: [50, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ВФА", "ВФА", "ВФА", "ВФА", "ВФА", "ВФА", "САМИТ N"],
      ["ВФА", "ВФА", "ВФА", "ВФА", "ВФА", "ВФА", "ВФА"],
    ],
  },
  "c.2": {
    shares: [0, 0, 0, 60, 80, 70, 70],
    portfolios: [
      ["", "", "", "БПИФ", "БПИФ", "БПИФ", "БПИФ"],
      ["", "", "", "БПИФ", "БПИФ", "БПИФ", "БПИФ"],
      ["", "", "", "БПИФ", "БПИФ", "БПИФ", "БПИФ"],
    ],
  },
  "c.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "c.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["", "", "", "ОФЗ", "ОФЗ", "ОФЗ", "ОФЗ"]],
  },
  "d.1": {
    shares: [50, 60, 60, 50, 60, 70, 50],
    portfolios: [
      ["ЕО", "ЕО", "ВФА", "ВФА", "ВФА", "ВФА", "САМИТ P"],
      ["САМИТ N", "САМИТ N", "САМИТ N", "САМИТ N", "АК", "АК", "ВФА"],
    ],
  },
  "d.2": {
    shares: [0, 0, 0, 60, 80, 70, 70],
    portfolios: [
      ["АК", "АК", "АК", "САМИТ N", "САМИТ N", "САМИТ N", "АК"],
      ["АК", "АК", "АК", "БПИФ", "ВФА", "САМИТ P", "АК"],
      ["АК", "АК", "АК", "АК", "АК", "ВФА", "АК"],
    ],
  },
  "d.3": {
    shares: [100, 100, 100, 100, 100, 100, 100],
    portfolios: [["ОФЗ", "КОРП", "ОФЗ", "КОРП", "КОРП", "КОРП", "КОРП"]],
  },
  "d.4": {
    shares: [0, 0, 0, 0, 0, 0, 0],
    portfolios: [["AD", "AD", "AD", "ЛБ", "ЛБ", "ЛБ", "ЛБ"]],
  },
};
