export const RECOMMENDATION_MATRIX = [
  {
    minAmount: 5000000,
    "Хочу полный выбор сервисов": `Вам доступен сервис Личный брокер! Ваш персональный инвестиционный консультант, который поможет структурировать ваши финансы и эффективно управлять капиталом. Он подберёт подходящие именно вам инвестиционные решения, обеспечит максимальную прозрачность всех операций и своеверменные консультации.`,
    "Хочу получать рекомендации, но решения принимаю самостоятельно": `Вам доступен сервис Личный брокер! Ваш персональный инвестиционный консультант, который поможет структурировать ваши финансы и эффективно управлять капиталом. Он подберёт подходящие именно вам инвестиционные решения, обеспечит максимальную прозрачность всех операций и своеверменные консультации.`,
    "Хочу персональное сопровождение моих инвестиций": `Вам доступен сервис Личный брокер! Ваш персональный инвестиционный консультант, который поможет структурировать ваши финансы и эффективно управлять капиталом. Он подберёт подходящие именно вам инвестиционные решения, обеспечит максимальную прозрачность всех операций и своеверменные консультации.`,
    "Рекомендации не требуются": `Вам доступен сервис Личный брокер! Ваш персональный инвестиционный консультант, который поможет структурировать ваши финансы и эффективно управлять капиталом. Он подберёт подходящие именно вам инвестиционные решения, обеспечит максимальную прозрачность всех операций и своеверменные консультации.`,
  },
  {
    minAmount: 300000,
    "Хочу полный выбор сервисов": `Вам доступен сервис Модельный портфель! Аналитики отбирают бумаги, анализируют рынок, вам остается одной обновить ваш портфель. Это удобно, быстро и качественно!`,
    "Хочу получать рекомендации, но решения принимаю самостоятельно": `Вам доступен сервис Ваш финансовый аналитик! Сервис отправляет Вам уведомление об открытии и закрытии инвест идеи от аналитиков Открытие брокер. `,
    "Хочу персональное сопровождение моих инвестиций": `"Вам доступен сервис "Тренер по трейдингу" бесплатно! Личное сопровождение (сервис Личный брокер) предоставляется от 5 000 000 рублей. Рекомендуется увеличить сумму брокерского счета."`,
    "Рекомендации не требуются": `Вам доступен сервис "Тренер по трейдингу" бесплатно! Личное сопровождение (сервис Личный брокер) предоставляется от 5 000 000 рублей. Рекомендуем увеличить сумму брокерского счета.`,
  },
  {
    minAmount: 10000,
    "Хочу полный выбор сервисов": `Сервис "Модельный портфель" предлагает удобный формат инвестирования. Аналитики отбирают бумаги, анализируют рынок, вам остается одной кнопкой обновить ваш портфель. Это удобно, быстро и качественно! Пополните счет от 300 000 руб.`,
    "Хочу получать рекомендации, но решения принимаю самостоятельно": `Посетите семинар основы технического анализа 1 апреля 2020 года. Для подключения к сервису Ваш финансовый аналитик Вам нужно пополить счет от 300 000 руб.`,
    "Хочу персональное сопровождение моих инвестиций": `Личное сопровождение (сервис Личный брокер) предоставляется от 5 000 000 рублей. Рекомендуется увеличить сумму брокерского счета.`,
    "Рекомендации не требуются": ``,
  },
];
