export const RECS_LIST   = [
  {
    type: "ИИС",
    title: "Откройте ИИС с типом вычета А",
    salesPoint:
      "Увеличивайте Ваш доход от инвестиций налоговым вычетом +52 000 руб от суммы взноса. Успейте открыть и пополнить счет в этом году, чтобы получить 52 000 рублей уже в начале следующего года!",
  },
  {
    type: "ИИС",
    title: "Откройте ИИС с типом вычета Б",
    salesPoint:
      "Когда заработок по счету превышает 400 000 руб в год, получение вычета от суммы взноса по типу А становится неинтересным. Поэтому именно для Вас мы хотим подчеркнуть, что инвестиции через счет-ИИС позволят освободить положительный финансовый результат от уплаты налога на прибыть, а это +13% ко всей сумме Вашего заработка!",
  },
  {
    type: "сопровождение",
    title: "Личный брокер",
    salesPoint:
      "Персональное сопровождение Ваших инвестиций от профессионального сотрудника Открытие брокер.",
  },
  {
    type: "сопровождение",
    title: "Тренер по трейдингу",
    salesPoint:
      "Тренер обучит вас азам торговли, поможет настроить торговый терминал и ответит на все, даже самые сложные вопросы. Вы получите только нужную и полезную вам информацию, которую сможете сразу же проверить на практике.",
  },
  {
    type: "сопровождение",
    title: `Курс "Что такое структурные продукты"`,
    salesPoint:
      "В рамках курса Вы можете узнать принцип работы структурных продуктов, а также сможете оформлять структурный продукт самостоятельно.",
  },
  {
    type: "сопровождение",
    title: `курс "Академия успешного трейдинга"`,
    salesPoint:
      "На курсе разбираются ключевые стратегии анализа рынка и финансовых инструментов.",
  },
  {
    type: "семинар",
    title: `Курс "Личное финансовое планирование"`,
    salesPoint:
      "Предлагаем пройти бесплатный курс, состоящий из 4 уроков. На курсе будут разобраны темы,к которые позволят вам разобраться в основах построения личного портфеля.",
  },
  {
    type: "маркетинг",
    title: `Программа лояльности "O! Investore"`,
    salesPoint:
      "Участвуйте в акциях, получайте кэшбек, копите бонусные баллы и обменивайте их на подарки.",
  },
];
