export const TERMINAL_CONTENT = [
  {
    name: "Личный кабинет и мобильное приложение Открытие брокер",
    selected: true,
    intro: "",
    keyAttributes: [
      "Многофункциональный терминал, который несет не только торговые функции, но и функции управления и анализа счета.",
      "Широкий торговый функционал. Доступны: Московская биржа фондовый рынок (рублевые инструменты), валютный рынок, срочный рынок (фьючерсы) , Санкт-Петербургская биржа. Недоступны: Иностранные торговые площадки и внебиржевые сделки.",
      "Аналитика от Открытие брокер, при подключении сервиса Ваш финансовый аналитик",
      "Отчеты по активам и счетам. Удобно для анализа прироста активов, полученных дивидендов и купонов. Возможность выгрузить отчет брокера по совершенным сделкам",
      "Налоговый калькулятор позволяет сделать предрасчет",
      "Личный кабинет - это абсолютно бесплатный терминал! Рекомендован для установки каждому клиенту",
    ],
  },
  {
    name: "QUIK",
    selected: false,
    intro:
      "QUIK - самая популярная торговая программ, котрую используют как частные трейдеры, так и профессиональные участники. ",
    keyAttributes: [
      "Терминал поддерживает все российские и иностранные торговые площадки, а также внебиржевой рынок еврооблигаций -  только в Открытие брокер!",
      "Доступны все виды заявок, в том числе алгоритмические",
      "Предлагается в трех вариантах: программа на ПК, мобильное прложение (IOS и Android), web-версия в браузере.",
      "Каждому клиенту один терминал QUIK для ПК предоставляется бесплатно! За каждый последующий – 121 руб. в месяц Web-QUIK и одно мобильное приложение также предоставляется бесплатно,при наличии на счете более 50 000 рублей. Каждое последующее моб.приложение - 250 руб. в месяц.",
    ],
  },
  {
    name: "Metatrader 5",
    selected: false,
    intro:
      "Система MetaTrader 5 – лидер по обеспечению доступа на внебиржевой рынок FOREX. Пятая версия системы реализовывает доступ к биржевым рынкам.",
    keyAttributes: [
      "Metatrader 5 дает доступ только к трем площадкам Московской биржи: Фондовый, валютный и срочный рынки",
      "Расчеты возможны только в рублях, поэтому на фондовом рынке недоступны еврооблигации, на валютном рынке - валютные пары с расчетами в долларах. На срочном рынке торгуются только фьючерсы.",
      "Недоступны сервисы: Ваш Финансовый Аналитик, Модельный портфель и опция Единого брокерского счета.",
      "Всем клиентам один терминал предоставляется бесплатно!",
      "За каждый последующий – 182 руб. в месяц",
    ],
  },
];
