export default class Footer {
  constructor({ container, openBrokerLogo }) {
    this.container = container;
    this.openBrokerLogo = openBrokerLogo;
  }

  createFooter() {
    this.footerElement = document.createElement("footer");
    this.footerElement.classList.add("footer");

    const openBrokerLogoElement = document.createElement("img");
    openBrokerLogoElement.classList.add("section__logo");
    openBrokerLogoElement.src = this.openBrokerLogo;

    const disclaimerElement = document.createElement("p");
    disclaimerElement.classList.add("disclaimer");
    disclaimerElement.textContent = `АО «Открытие Брокер», лицензия профессионального участника рынка
    ценных бумаг на осуществление брокерской деятельности №
    045-06097-100000, выдана ФКЦБ России 28.06.2002 (без ограничения срока
    действия). С информацией об АО «Открытие Брокер» получатели финансовых
    услуг могут ознакомиться в разделе «Документы и раскрытие информации».
    Информация о тарифных планах/тарифах опубликована в маркетинговых
    целях в сокращённом варианте. Полный перечень тарифных планов/тарифов,
    их содержание и условия применения содержатся на сайте open-broker.ru
    в приложении № 2 «Тарифы» к договору на брокерское
    обслуживание/договору на ведение индивидуального инвестиционного счёта
    АО «Открытие Брокер». Необходимо иметь это в виду при выборе тарифного
    плана. Под «сервисом» понимается одно или несколько (совокупность)
    условий брокерского обслуживания клиентов, включая, но не
    ограничиваясь: открытие определённого портфеля, ведение отдельного
    инвестиционного счёта, предложение тарифного плана, предоставление
    клиенту информационных сообщений, а также иные условия,
    предусмотренные договором и/или Регламентом обслуживания клиентов АО
    «Открытие Брокер» и/или дополнительным соглашением с клиентом и/или
    размещённые на сайте АО «Открытие Брокер». Подробнее о каждом сервисе
    вы можете узнать на сайте компании, в личном кабинете или обратившись
    к сотруднику АО «Открытие Брокер». Сервис дистанционного оформления
    предоставляется для первичного открытия счёта в компании. Для
    дистанционного заключения договора необходима подтверждённая учётная
    запись на портале «Госуслуги» или идентификация в системе
    межведомственного электронного взаимодействия (СМЭВ). Представленные
    вебинары, видео-уроки и иные материалы не являются образовательной
    деятельностью, их прохождение не сопровождается выдачей документов об
    образовании и (или) квалификации. Инвестирование в финансовые
    инструменты связано с высокой степенью рисков и не подразумевает
    каких-либо гарантий как по возврату основной инвестированной суммы,
    так и по получению каких-либо доходов. Условия инвестирования в
    структурные продукты приведены справочно. Перед приобретением
    структурного продукта обязательно ознакомьтесь с декларациями о рисках
    в разделе 11 договора на брокерское обслуживание, спецификацией
    структурного продукта «Автоколл» или «С защитой капитала» и условиями
    опционного договора. Структурный продукт не является банковским
    вкладом, денежные средства по структурному продукту не застрахованы в
    соответствии с Федеральным законом от 23.12.2003 № 177-ФЗ «О
    страховании вкладов физических лиц в банках Российской Федерации».
    Требования, связанные с участием физического лица во внебиржевом
    опционном договоре, не подлежат судебной защите. Какие-либо выплаты по
    структурному продукту, а также возврат первоначально инвестированной
    суммы не являются гарантированными и безусловными. Индивидуальный
    инвестиционный счёт (ИИС) может открыть только физическое лицо
    (налоговый резидент РФ). Физическое лицо может иметь только один ИИС.
    Индивидуальный инвестиционный счет дает право на получение ежегодно до
    52 000 руб., исходя из внесенных за календарный год денежных средств
    на ИИС, но не более суммы уплаченного НДФЛ по ставке 13 % за
    соответствующий период, либо налогом на доходы физических лиц не
    облагается доход, полученный от операций с ценными бумагами и ПФИ на
    ИИС по истечении не менее 3 лет с даты подписания договора. В случае
    вывода денежных средств с ИИС до истечения трехлетнего периода сумма
    налога подлежит восстановлению и уплате в бюджет. Подавать документы в
    Федеральную налоговую службу на получение вычета владелец ИИС должен
    самостоятельно. Представленная информация не является индивидуальной
    инвестиционной рекомендацией, ни при каких условиях, в том числе при
    внешнем совпадении ее содержания с требованиями нормативно-правовых
    актов, предъявляемых к индивидуальной инвестиционной рекомендации.
    Любое сходство представленной информации с индивидуальной
    инвестиционной рекомендацией является случайным. Какие-либо из
    представленных финансовых инструментов или операций могут не
    соответствовать Вашему инвестиционному профилю и не учитывать Ваши
    ожидания по уровню риска и/или доходности. Упомянутые в представленной
    информации операции и/или финансовые инструменты, ни при каких
    обстоятельствах, не гарантируют доход, на который Вы возможно
    рассчитываете при условии использования предоставленной информации для
    принятия инвестиционных решений. Информация не является предложением
    или побуждением совершать операции на финансовом рынке. Во всех
    случаях определение соответствия финансового инструмента либо операции
    инвестиционным целям, инвестиционному горизонту и толерантности к
    риску является задачей инвестора. Вы самостоятельно принимаете все
    инвестиционные решения. Общество с ограниченной ответственностью
    «Управляющая компания «Открытие». Лицензия № 21-000-1-00048 от 11
    апреля 2001 г. на осуществление деятельности по управлению
    инвестиционными фондами, паевыми инвестиционными фондами и
    негосударственными пенсионными фондами, выданная ФКЦБ России, без
    ограничения срока действия. Лицензия профессионального участника рынка
    ценных бумаг №045-07524-001000 от 23 марта 2004 г. на осуществление
    деятельности по управлению ценными бумагами, выданная ФКЦБ России, без
    ограничения срока действия. Получить подробную информацию о паевых
    инвестиционных фондах и услугах по индивидуальному доверительному
    управлению, ознакомиться с правилами доверительного управления паевыми
    инвестиционными фондами, а также иными документами можно по адресу:
    Российская Федерация, 115114, город. Москва, улица Кожевническая, дом
    14, строение 5, тел.: (495) 232-59-73, а также в сети Интернет по
    адресу: www.open-am.ru. Прежде чем приобрести инвестиционный пай,
    следует внимательно ознакомиться с правилами доверительного управления
    паевым инвестиционным фондом. Стоимость инвестиционных паев может
    увеличиваться и уменьшаться, результаты инвестирования в прошлом не
    определяют доходы в будущем, государство не гарантирует доходность
    инвестиций в паевые инвестиционные фонды. Взимание надбавок (скидок)
    уменьшит доходность инвестиций в инвестиционные паи паевого
    инвестиционного фонда. Результаты деятельности управляющего по
    управлению ценными бумагами в прошлом не определяют доходы учредителя
    управления в будущем. Правила доверительного управления ОПИФ рыночных
    финансовых инструментов «Открытие — Акции» зарегистрированы ФКЦБ
    России 17.12.2003 №0164-70287842; Правила доверительного управления
    ОПИФ рыночных финансовых инструментов «Открытие — Облигации»
    зарегистрированы ФКЦБ России 17.12.2003 №0165-70287767; Правила
    доверительного управления ОПИФ рыночных финансовых инструментов
    «Открытие — Индекс МосБиржи» зарегистрированы ФСФР России 05.07.2007
    №0890-94127385; Правила доверительного управления ЗПИФ денежного рынка
    «Царский мост» зарегистрированы ФСФР России 08.11.2007 №1073-58229210;
    Правила доверительного управления ОПИФ рыночных финансовых
    инструментов «Открытие — Зарубежная собственность» зарегистрированы
    ФСФР России 16.04.2013 №2588; Правила доверительного управления ОПИФ
    рыночных финансовых инструментов «Открытие — Лидеры инноваций»
    зарегистрированы ФСФР России 16.04.2013 №2586; Правила доверительного
    управления ОПИФ рыночных финансовых инструментов «Открытие —
    Еврооблигации» зарегистрированы ФСФР России 08.12.2011 №2275; Правила
    доверительного управления ОПИФ рыночных финансовых инструментов
    «Открытие — Золото» зарегистрированы ФСФР России 08.12.2011 №2277;
    Правила доверительного управления ОПИФ рыночных финансовых
    инструментов «Открытие — Сбалансированный» зарегистрированы ФСФР
    России 08.12.2011 №2279; Правила доверительного управления ОПИФ
    рыночных финансовых инструментов «Открытие — Глобальные инвестиции»
    зарегистрированы Банком России 29.10.2015 №3059.`;

    this.footerElement.appendChild(openBrokerLogoElement);
    this.footerElement.appendChild(disclaimerElement);

    this.container.appendChild(this.footerElement);
  }
}
